In [1]:
import numpy as np
import pandas as pd

In [2]:
d1 = {
    'name' : ['prathmesh', 'siddhi', 'ravi', 'mangal'],
    'marks' : [99, 89, 95, 94],
    'city' : ['khatav', 'satara', 'mumbai', 'rahatni']
}

In [3]:
d1

{'name': ['prathmesh', 'siddhi', 'ravi', 'mangal'],
 'marks': [99, 89, 95, 94],
 'city': ['khatav', 'satara', 'mumbai', 'rahatni']}

In [4]:
df = pd.DataFrame(d1)

In [5]:
df

        name  marks     city
0  prathmesh     99   khatav
1     siddhi     89   satara
2       ravi     95   mumbai
3     mangal     94  rahatni

In [6]:
df.to_csv('ex1.csv')

In [7]:
df.to_csv('ex2.csv', index = False)

In [8]:
df.head(2)

        name  marks    city
0  prathmesh     99  khatav
1     siddhi     89  satara

In [9]:
df.tail(2)

     name  marks     city
2    ravi     95   mumbai
3  mangal     94  rahatni

In [11]:
df.describe()

           marks
count   4.000000
mean   94.250000
std     4.112988
min    89.000000
25%    92.750000
50%    94.500000
75%    96.000000
max    99.000000

In [12]:
read_csv = pd.read_csv('read_csv.csv')

In [13]:
read_csv

        name  marks       city
0  prathmesh     99     khatav
1     siddhi     89     satara
2       ravi     95     mumbai
3     mangal     94    rahatni
4       sham     67       pune
5        ram     78  gorakhpur

In [15]:
read_csv['marks']

0    99
1    89
2    95
3    94
4    67
5    78
Name: marks, dtype: int64

In [16]:
read_csv['marks'][0]

99

In [17]:
read_csv['marks'][0] = 100

C:\Users\prathmesh\AppData\Local\Programs\Python\Python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [18]:
read_csv

        name  marks       city
0  prathmesh    100     khatav
1     siddhi     89     satara
2       ravi     95     mumbai
3     mangal     94    rahatni
4       sham     67       pune
5        ram     78  gorakhpur

In [19]:
read_csv.index = [1, 2, 3, 4, 5, 6]

In [20]:
read_csv

        name  marks       city
1  prathmesh    100     khatav
2     siddhi     89     satara
3       ravi     95     mumbai
4     mangal     94    rahatni
5       sham     67       pune
6        ram     78  gorakhpur